-------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercis
> es\course-project-nepobabies\nepobabies.log
  log type:  text
 opened on:  16 Apr 2024, 12:54:32

. 
. do "C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\cour
> se-project-nepobabies\nepobabies.do"

. * Direct file path
. cd "C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\cour
> se-project-nepobabies"
C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\course-pro
> ject-nepobabies

. 
. * Direct Stata to use the cleaned GSS dataset
. use "GSSclean_noRDs"

. 
. ** This prevents false positives from occurring for the nepobaby, panepobaby, and m
> anepobaby variables.
. replace indus10 = 1 if missing(indus10)
(5,219 real changes made)

. 
. ** Creating dummy variable for nepobaby = 1 if respondent is in the same industry a
> s their mother or father, 0 otherwise
. gen nepobaby = ((indus10 == paind10)|(indus10 == maind10))

. ** Create variable for being in the same industry as ONLY a respondent's father. (s
> ame false positives as nepobaby)
. gen panepobaby = (indus10 == paind10)

. ** Create variable for being in the same industry as ONLY a respondent's mother. (s
> ame false positives as nepobaby)
. gen manepobaby = (indus10 == maind10)

. 
. ** Getting rid of missing data
. ** dateintv variable needed to determine hire date.
. drop if missing(dateintv)
(5,111 observations deleted)

. ** We can only perform analysis for the respondents who answered the `yearsjob` que
> stion.
. drop if missing(yearsjob)
(58,023 observations deleted)

. ** Dropping observations for age not recorded - cannot accurately measure agehire w
> ithout age.
. drop if missing(age)
(118 observations deleted)

. * dropping because the 2022 survey year does not include necessary variables for de
> fining a variable.
. drop if year== 2022
(1,863 observations deleted)

. 
. * Convert dateintv to a string for easier manipulation
. gen dateintv_str = string(dateintv)

. 
. * Extract dayintv (last two digits)
. gen dayintv = real(substr(dateintv_str, -2, .))

. 
. * Extract monthintv based on the length of dateintv
. gen monthintv = .
(7,275 missing values generated)

. replace monthintv = real(substr(dateintv_str, 1, 1)) if length(dateintv_str) == 3
(7,152 real changes made)

. replace monthintv = real(substr(dateintv_str, 1, 2)) if length(dateintv_str) == 4
(123 real changes made)

. 
. * Renaming year variable for clarity. It should be made clear that the year variabl
> e attached to observations denotes the year they were interviewed, not the year the
> y were hired.
. rename year yearintv

. 
. ** This created a variable for the year and month a respondent was interviewed!
. ** It does so in the format of a Stata date, where Jan. 1960 is considered 1 and ev
> ery month's code after that = (months after Jan. 1960)
. gen ymintdate = ym(yearintv, monthintv)

. 
. ** Creates a variable for the month and year a respondent was hired (assuming they 
> were hired exactly the number of years ago they reported) which leaves us with 9,25
> 6 variables/.
. gen ymhiredate = ymintdate - (yearsjob * 12)

. 
. * For ease of merging FRED data
. sort ymhiredate

. 
. * Merging FRED unemployment rate based on ymhiredate variable
. merge m:m ymhiredate using "C:\Users\rpseely\OneDrive - Syracuse University\Documen
> ts\GitHub\exercises\course-project-nepobabies\FRED_unrate_60to22_robust.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           361
        from master                        12  (_merge==1)
        from using                        349  (_merge==2)

    matched                             7,263  (_merge==3)
    -----------------------------------------

. **** THIS NEEDS TO BE FIXED, LIKE ALTER THE DATASET SO THAT IT IS JUST ymhiredate A
> ND DOES NOT INCLUDE ymhiredate_m3, etc.
. 
. * dropping the few observations that failed to merge data
.  drop if _merge == 1
(12 observations deleted)

.  drop if _merge == 2
(349 observations deleted)

. 
. rename UNRATE unemployrate

.  
. * Creating variable for age at time of hiring, i.e. age at ymhiredate
. gen agehire = age - yearsjob

. 
. 
. * Association between being a nepobaby and hired young
. gen hireyoung = .
(7,263 missing values generated)

. 
. replace hireyoung = 1 if (agehire > 30)
(4,182 real changes made)

. 
. replace hireyoung = 2 if (age hire <= 30)
(3,081 real changes made)

. 
. replace hireyoung = . if ((paind10 == .i) | (maind10 == .i))
(3,231 real changes made, 3,231 to missing)

. 
. tab hireyoung nepobaby, chi2

           |       nepobaby
 hireyoung |         0          1 |     Total
-----------+----------------------+----------
         1 |     2,078        166 |     2,244 
         2 |     1,573        215 |     1,788 
-----------+----------------------+----------
     Total |     3,651        381 |     4,032 

          Pearson chi2(1) =  24.8996   Pr = 0.000

. * Significant association
. 
. logit nepobaby agehire, or

Iteration 0:   log likelihood = -1932.9284  
Iteration 1:   log likelihood =  -1901.035  
Iteration 2:   log likelihood = -1900.1205  
Iteration 3:   log likelihood = -1900.1199  
Iteration 4:   log likelihood = -1900.1199  

Logistic regression                             Number of obs     =      7,263
                                                LR chi2(1)        =      65.62
                                                Prob > chi2       =     0.0000
Log likelihood = -1900.1199                     Pseudo R2         =     0.0170

------------------------------------------------------------------------------
    nepobaby | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     agehire |   .9676508   .0041429    -7.68   0.000     .9595649    .9758049
       _cons |   .2419224   .0344405    -9.97   0.000     .1830195    .3197826
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. * Significant association
. * Should probably move this to data section, or keep it at the top to say this is w
> hy we focus on young adults.
. * Odds ratio = 0.9676843 , so 3.3% decrease in likelihood of being a nepobaby assoc
> iated with being hired each year older.
. * need to run this again without 2022 data
. 
. * Keeping observations only of target group; people hired as young adults
. drop if agehire > 29
(4,411 observations deleted)

. * Leaves us with 2,852 observations
. 
. 
. 
. 
. ** Chi square test of all groups of unemployment
. gen unemployrate_groups = .
(2,852 missing values generated)

. 
. replace unemployrate_groups = 1 if unemployrate <= 4.7
(807 real changes made)

. 
. replace unemployrate_groups = 2 if (unemployrate > 4.7) & (unemployrate <= 5.5)
(673 real changes made)

. 
. replace unemployrate_groups = 3 if (unemployrate > 5.5) & (unemployrate < 6.8)
(652 real changes made)

. 
. replace unemployrate_groups = 4 if unemployrate >= 6.8
(720 real changes made)

. 
. * Cross-tabulation & chi-square test of the three groups of hiring in terms of unem
> ployment
. tabulate nepobaby unemployrate_groups, chi2

           |             unemployrate_groups
  nepobaby |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       736        605        585        639 |     2,565 
         1 |        71         68         67         81 |       287 
-----------+--------------------------------------------+----------
     Total |       807        673        652        720 |     2,852 

          Pearson chi2(3) =   2.5817   Pr = 0.461

. * Updated unemployrate values for no 2022 data.
. 
. 
. 
. *** START OF SENSITIVTY ANALYSIS ... CURRENT CODE IS A PLACE FILLER ***
. 
. 
. * SA FOR MINUS 3
. drop ymhiredate_m3

. gen ymhiredate_m3 = ymhiredate

. 
. drop _merge

. 
. merge m:m ymhiredate_m3 using "C:\Users\rpseely\OneDrive - Syracuse University\Docu
> ments\GitHub\exercises\course-project-nepobabies\minus3.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           364
        from master                         0  (_merge==1)
        from using                        364  (_merge==2)

    matched                             2,852  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 1
(0 observations deleted)

. drop if _merge == 2
(364 observations deleted)

. 
. 
. ** Chi square test of all groups of unemployment (ymhiredate of 3 months earlier)
. gen unemployrate_groups_m3 = .
(2,852 missing values generated)

. 
. replace unemployrate_groups_m3 = 1 if unemployrate_m3 <= 4.7
(753 real changes made)

. 
. replace unemployrate_groups_m3 = 2 if (unemployrate_m3 > 4.7) & (unemployrate_m3 <=
>  5.5)
(725 real changes made)

. 
. replace unemployrate_groups_m3 = 3 if (unemployrate_m3 > 5.5) & (unemployrate_m3 < 
> 6.8)
(658 real changes made)

. 
. replace unemployrate_groups_m3 = 4 if unemployrate_m3 >= 6.8
(716 real changes made)

. 
. replace unemployrate_groups_m3 = . if yearsjob < 1
(633 real changes made, 633 to missing)

. 
. * Cross-tabulation & chi-square test of the three groups of hiring in terms of unem
> ployment
. tabulate nepobaby unemployrate_groups_m3, chi

           |           unemployrate_groups_m3
  nepobaby |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       493        501        452        543 |     1,989 
         1 |        45         59         55         71 |       230 
-----------+--------------------------------------------+----------
     Total |       538        560        507        614 |     2,219 

          Pearson chi2(3) =   3.4121   Pr = 0.332

. * This seems to have worked! In the sense that it performed the analysis I wanted i
> t to.
. * It gives us a p-value of 0.332
. 
. 
. 
. 
. * SA FOR MINUS 6
. drop ymhiredate_m6

. 
. gen ymhiredate_m6 = ymhiredate

. 
. drop _merge

. 
. merge m:m ymhiredate_m6 using "C:\Users\rpseely\OneDrive - Syracuse University\Docu
> ments\GitHub\exercises\course-project-nepobabies\minus6.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           364
        from master                         0  (_merge==1)
        from using                        364  (_merge==2)

    matched                             2,852  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 1
(0 observations deleted)

. drop if _merge == 2
(364 observations deleted)

. 
. 
. ** Chi square test of all groups of unemployment (ymhiredate of 6 months earlier)
. gen unemployrate_groups_m6 = .
(2,852 missing values generated)

. 
. replace unemployrate_groups_m6 = 1 if unemployrate_m6 <= 4.7
(836 real changes made)

. 
. replace unemployrate_groups_m6 = 2 if (unemployrate_m6 > 4.7) & (unemployrate_m6 <=
>  5.5)
(575 real changes made)

. 
. replace unemployrate_groups_m6 = 3 if (unemployrate_m6 > 5.5) & (unemployrate_m6 < 
> 6.8)
(768 real changes made)

. 
. replace unemployrate_groups_m6 = 4 if unemployrate_m6 >= 6.8
(673 real changes made)

. 
. replace unemployrate_groups_m6 = . if yearsjob < 1
(633 real changes made, 633 to missing)

. 
. * Cross-tabulation & chi-square test of the three groups of hiring in terms of unem
> ployment
. tabulate nepobaby unemployrate_groups_m6, chi

           |           unemployrate_groups_m6
  nepobaby |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       528        478        458        525 |     1,989 
         1 |        53         46         61         70 |       230 
-----------+--------------------------------------------+----------
     Total |       581        524        519        595 |     2,219 

          Pearson chi2(3) =   4.7168   Pr = 0.194

. *  p-value of 0.205, so it does not pass the sensitivity analysis
. 
. 
. 
. 
. 
. 
. 
. 
. 
. * SA FOR PLUS 3
. drop ymhiredate_p3

. 
. gen ymhiredate_p3 = ymhiredate

. 
. drop _merge

. 
. merge m:m ymhiredate_p3 using "C:\Users\rpseely\OneDrive - Syracuse University\Docu
> ments\GitHub\exercises\course-project-nepobabies\plus3.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           369
        from master                         4  (_merge==1)
        from using                        365  (_merge==2)

    matched                             2,848  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 1
(4 observations deleted)

. drop if _merge == 2
(365 observations deleted)

. 
. 
. ** Chi square test of all groups of unemployment (ymhiredate of 6 months earlier)
. gen unemployrate_groups_p3 = .
(2,848 missing values generated)

. 
. replace unemployrate_groups_p3 = 1 if unemployrate_p3 <= 4.7
(793 real changes made)

. 
. replace unemployrate_groups_p3 = 2 if (unemployrate_p3 > 4.7) & (unemployrate_p3 <=
>  5.5)
(726 real changes made)

. 
. replace unemployrate_groups_p3 = 3 if (unemployrate_p3 > 5.5) & (unemployrate_p3 < 
> 6.8)
(614 real changes made)

. 
. replace unemployrate_groups_p3 = 4 if unemployrate_p3 >= 6.8
(715 real changes made)

. 
. replace unemployrate_groups_p3 = . if yearsjob < 1
(633 real changes made, 633 to missing)

. 
. * Cross-tabulation & chi-square test of the three groups of hiring in terms of unem
> ployment
. tabulate nepobaby unemployrate_groups_p3, chi

           |           unemployrate_groups_p3
  nepobaby |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       508        445        528        504 |     1,985 
         1 |        49         55         62         64 |       230 
-----------+--------------------------------------------+----------
     Total |       557        500        590        568 |     2,215 

          Pearson chi2(3) =   2.1976   Pr = 0.532

. * p-value of 0.532, so does not pass the sensitivity analysis :(
. 
. 
. 
. 
. 
. 
. 
. 
. * SA FOR PLUS 6
. drop ymhiredate_p6

. 
. gen ymhiredate_p6 = ymhiredate

. 
. drop _merge

. 
. merge m:m ymhiredate_p6 using "C:\Users\rpseely\OneDrive - Syracuse University\Docu
> ments\GitHub\exercises\course-project-nepobabies\plus6.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           369
        from master                         2  (_merge==1)
        from using                        367  (_merge==2)

    matched                             2,846  (_merge==3)
    -----------------------------------------

. 
. drop if _merge == 1
(2 observations deleted)

. drop if _merge == 2
(367 observations deleted)

. 
. 
. ** Chi square test of all groups of unemployment (ymhiredate of 6 months earlier)
. gen unemployrate_groups_p6 = .
(2,846 missing values generated)

. 
. replace unemployrate_groups_p6 = 1 if unemployrate_p6 <= 4.7
(836 real changes made)

. 
. replace unemployrate_groups_p6 = 2 if (unemployrate_p6 > 4.7) & (unemployrate_p6 <=
>  5.5)
(670 real changes made)

. 
. replace unemployrate_groups_p6 = 3 if (unemployrate_p6 > 5.5) & (unemployrate_p6 < 
> 6.8)
(589 real changes made)

. 
. replace unemployrate_groups_p6 = 4 if unemployrate_p6 >= 6.8
(751 real changes made)

. 
. replace unemployrate_groups_p6 = . if yearsjob < 1
(633 real changes made, 633 to missing)

. 
. * Cross-tabulation & chi-square test of the three groups of hiring in terms of unem
> ployment
. tabulate nepobaby unemployrate_groups_p6, chi

           |           unemployrate_groups_p6
  nepobaby |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       506        443        514        520 |     1,983 
         1 |        49         43         68         70 |       230 
-----------+--------------------------------------------+----------
     Total |       555        486        582        590 |     2,213 

          Pearson chi2(3) =   5.1171   Pr = 0.163

. * p-value of 0.163, so it does pass the sensitivity analysis :)
. 
. 
. 
. 
. 
. 
. 
. 
. 
. * correlation
. egen nepobaby_1 = total(nepobaby == 1), by(unemployrate)

. egen nepobaby_0 = total(nepobaby == 0 | nepobaby == 1), by(unemployrate)

. gen nepobaby_ratio = nepobaby_1 / nepobaby_0

. 
. 
. * Correlation between nepobaby : allworkers ratio and the unemployment rate
. pwcorr nepobaby_ratio unemployrate, sig

             | nepoba~o unempl~e
-------------+------------------
nepobaby_r~o |   1.0000 
             |
             |
unemployrate |   0.0979   1.0000 
             |   0.0000
             |

. * weak but significant relationship (0.0979 correlation)
. *Showing the realtionship graphically
. scatter nepobaby_ratio unemployrate || lfit nepobaby_ratio unemployrate

. 
. 
. // Fit logistic regression
. logistic nepobaby unemployrate

Logistic regression                             Number of obs     =      2,846
                                                LR chi2(1)        =       0.66
                                                Prob > chi2       =     0.4183
Log likelihood = -930.12068                     Pseudo R2         =     0.0004

------------------------------------------------------------------------------
    nepobaby | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
unemployrate |   1.032062   .0399865     0.81   0.415     .9565919    1.113487
       _cons |   .0931502   .0221196   -10.00   0.000     .0584865    .1483583
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

. * p-value = 0.408
. 
. // Generate predicted probabilities
. predict p, pr

. 
. // Scatter plot with linear regression line and no individual data points
. twoway (scatter nepobaby unemployrate, msymbol(none)) ///
>        (line p unemployrate, lcolor(blue) lwidth(medium)), ///
>        xtitle(Unemployment Rate) ytitle(Probability of Having a Baby) ///
>        legend(off) ///
>        yscale(range(0 0.3))

. 
. 
. 
. 
. 
. 
. 
. 
. * Examining the ratio of nepobabies and all people hired during times of low and hi
> gh unemployment
. 
. * setting up group sizes given unemployment rates
. gen nepo_lowu = .
(2,846 missing values generated)

. replace nepo_lowu = 1 if unemployrate <= 4.7 & nepobaby == 1
(71 real changes made)

. replace nepo_lowu = 0 if unemployrate <= 4.7 & nepobaby == 0
(736 real changes made)

. 
. 
. gen nepo_midlu = .
(2,846 missing values generated)

. replace nepo_midlu = 1 if (unemployrate > 4.7) & (unemployrate <= 5.5) & nepobaby =
> = 1
(68 real changes made)

. replace nepo_midlu = 0 if (unemployrate > 4.7) & (unemployrate <= 5.5) & nepobaby =
> = 0
(599 real changes made)

. 
. gen nepo_midhu = .
(2,846 missing values generated)

. replace nepo_midhu = 1 if (unemployrate > 5.5) & (unemployrate < 6.8) & nepobaby ==
>  1
(67 real changes made)

. replace nepo_midhu = 0 if (unemployrate > 5.5) & (unemployrate < 6.8) & nepobaby ==
>  0
(585 real changes made)

. 
. gen nepo_highu = .
(2,846 missing values generated)

. replace nepo_highu = 1 if unemployrate >= 6.8 & nepobaby == 1
(81 real changes made)

. replace nepo_highu = 0 if unemployrate >= 6.8 & nepobaby == 0
(639 real changes made)

. 
. 
. 
. 
. * High unemployment
. gen allhire_highu = (unemployrate >= 6.8)

. 
. replace allhire_highu = . if nepobaby == 1
(287 real changes made, 287 to missing)

. 
. gen allhire_lowu = (unemployrate <= 4.7)

. 
. replace allhire_lowu = . if nepobaby == 1
(287 real changes made, 287 to missing)

. 
. gen allhire_midlu = (unemployrate > 4.7) & (unemployrate <= 5.5)

. 
. replace allhire_midlu = . if nepobaby == 1
(287 real changes made, 287 to missing)

. 
. gen allhire_midhu = (unemployrate > 5.5) & (unemployrate < 6.8)

. 
. replace allhire_midhu = . if nepobaby == 1
(287 real changes made, 287 to missing)

. 
. * Calculate the number of observations where nepo_highu = 1
. egen nepo_highu_1 = total(nepo_highu == 1)

. 
. * Calculate the number of observations where allhire_highu = 1
. egen allhire_highu_1 = total(allhire_highu == 1)

. 
. * Calculate the ratio
. gen ratio_high = nepo_highu_1 / allhire_highu_1

. 
. * To view the ratio of nepobabies hired in high unemployment to non-nepobabies hire
> d in high unemployment
. tab ratio_high

 ratio_high |      Freq.     Percent        Cum.
------------+-----------------------------------
   .1267606 |      2,846      100.00      100.00
------------+-----------------------------------
      Total |      2,846      100.00

. * With four groups the ratio is 0.126761
. 
. 
. 
. * Calculate the number of observations where nepo_lowu = 1
. egen nepo_lowu_1 = total(nepo_lowu == 1)

. 
. * Calculate the number of observations where allhire_lowu = 1
. egen allhire_lowu_1 = total(allhire_lowu == 1)

. 
. * Calculate the ratio
. gen ratio_low = nepo_lowu_1 / allhire_lowu_1

. 
. * To view the ratio of nepobabies hired in low unemployment to non-nepobabies hired
>  in low unemployment
. tab ratio_low

  ratio_low |      Freq.     Percent        Cum.
------------+-----------------------------------
   .0964674 |      2,846      100.00      100.00
------------+-----------------------------------
      Total |      2,846      100.00

. * Four groups ratio is now 0.096467
. 
. 
. * Calculate the number of observations where nepo_midu = 1
. egen nepo_midhu_1 = total(nepo_midhu == 1)

. 
. * Calculate the number of observations where allhire_midu = 1
. egen allhire_midhu_1 = total(allhire_midhu == 1)

. 
. * Calculate the ratio
. gen ratio_midh = nepo_midhu_1 / allhire_midhu_1

. 
. * To view the ratio of nepobabies hired in "middle" unemployment to non-nepobabies 
> hired in "middle" unemployment
. tab ratio_midh

 ratio_midh |      Freq.     Percent        Cum.
------------+-----------------------------------
   .1145299 |      2,846      100.00      100.00
------------+-----------------------------------
      Total |      2,846      100.00

. * Ratio is 0.11453
. 
. 
. 
. * Calculate the number of observations where nepo_midu = 1
. egen nepo_midlu_1 = total(nepo_midlu == 1)

. 
. * Calculate the number of observations where allhire_midu = 1
. egen allhire_midlu_1 = total(allhire_midlu == 1)

. 
. * Calculate the ratio
. gen ratio_midl = nepo_midlu_1 / allhire_midlu_1

. 
. * To view the ratio of nepobabies hired in "middle" unemployment to non-nepobabies 
> hired in "middle" unemployment
. tab ratio_midl

 ratio_midl |      Freq.     Percent        Cum.
------------+-----------------------------------
   .1135225 |      2,846      100.00      100.00
------------+-----------------------------------
      Total |      2,846      100.00

. * Ratio is 0.113523
. 
. 
. 
. 
. 
. *To graphically view the relationships of all the ratios
.  graph bar (mean) ratio_high (mean) ratio_midh (mean) ratio_midl (mean) ratio_low, 
> blabel(bar) ytitle("Ratio of Nepobabies to Non-Nepobabies") title("Nepotism Hiring 
> in Different Labor Markets") legend(order(1 "high unemployment hire" 2 "mid-high un
> employment hire" 3 "mid-low unemployment hire" 4 "low unemployment hire"))

. 
. 
. 
. 
.  
.  
.  
. * Testing to see how nepobaby rates change with gender of parent and child
. 
. ** Nepobaby by FATHER
. 
. *Creating variable for male nepobabies with the same industry as their father.
. gen malenepopa = (panepobaby == 1 & sex == 1)

. 
. *Creating variable for female nepobabies with the same industry as their father.
. gen femalenepopa = (panepobaby == 1 & sex ==2)

. 
. *Marking irrelevant datapoints as missing
. replace malenepopa = . if panepobaby == 0
(2,677 real changes made, 2,677 to missing)

. replace femalenepopa = . if panepobaby == 0
(2,677 real changes made, 2,677 to missing)

. 
. *Removing instances of respondents having the same industry as both their mother an
> d father.
. replace malenepopa = . if (maind10 == paind10)
(24 real changes made, 24 to missing)

. replace femalenepopa = . if (maind10 == paind10)
(24 real changes made, 24 to missing)

. 
. *Testing the significance in the differences between the proportion of male and fem
> ale nepobabies with the same industry as their father.
. ttest femalenepopa == malenepopa

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
female~a |     145          .2    .0333333    .4013865    .1341142    .2658858
malene~a |     145          .8    .0333333    .4013865    .7341142    .8658858
---------+--------------------------------------------------------------------
    diff |     145         -.6    .0666667     .802773   -.7317717   -.4682283
------------------------------------------------------------------------------
     mean(diff) = mean(femalenepopa - malenepopa)                 t =  -9.0000
 Ho: mean(diff) = 0                              degrees of freedom =      144

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 0.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 1.0000

. 
. 
. *Adding in a chi-square test for the association between gender of respondent and b
> eing a nepobaby 
. 
. gen neposex = 1 if sex == 1
(1,382 missing values generated)

. replace neposex = 2 if sex == 2
(1,382 real changes made)

. replace neposex = . if nepobaby == 0
(2,559 real changes made, 2,559 to missing)

. gen nepoparentsex = 1 if (indus10 == paind10)
(2,677 missing values generated)

. replace nepoparentsex = 2 if (indus10 == maind10)
(142 real changes made)

. replace nepoparentsex = . if (indus10 != paind10 & indus10 != maind10)
(0 real changes made)

. replace nepoparentsex = . if (paind10 == maind10)
(24 real changes made, 24 to missing)

. 
. tab neposex nepoparentsex, chi2

           |     nepoparentsex
   neposex |         1          2 |     Total
-----------+----------------------+----------
         1 |       116         34 |       150 
         2 |        29         84 |       113 
-----------+----------------------+----------
     Total |       145        118 |       263 

          Pearson chi2(1) =  69.5578   Pr = 0.000

. *Ran this code, got a very strong result with a p-value of 0.000
. 
. 
. 
. 
. 
. 
. 
. * Creating bar graph to visualize the t-test
. graph bar (mean) malenepopa (mean) femalenepopa, title(`"Male vs. Female Nepobabies
>  - Father"')

. 
. * Creating a better bar graphically
. gen nepomale = 1 if sex == 1
(1,382 missing values generated)

. replace nepomale = . if nepobaby == 0
(1,304 real changes made, 1,304 to missing)

. replace nepomale = . if (paind10 == maind10)
(10 real changes made, 10 to missing)

. gen nepofemale = 1 if sex == 2
(1,464 missing values generated)

. replace nepofemale = . if nepobaby == 0
(1,255 real changes made, 1,255 to missing)

. replace nepofemale = . if (paind10 == maind10)
(14 real changes made, 14 to missing)

. tab nepomale

   nepomale |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        150      100.00      100.00
------------+-----------------------------------
      Total |        150      100.00

. tab nepofemale

 nepofemale |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        113      100.00      100.00
------------+-----------------------------------
      Total |        113      100.00

. 
. gen nepoparentsex_label = ""
(2,846 missing values generated)

. replace nepoparentsex_label = "Nepotistic Father" if nepoparentsex == 1
variable nepoparentsex_label was str1 now str17
(145 real changes made)

. replace nepoparentsex_label = "Nepotistic Mother" if nepoparentsex == 2
(118 real changes made)

. 
. 
. graph bar (count) nepomale nepofemale, over(nepoparentsex_label) ///
>     stack ///
>     title("Proportion of Male and Female Nepobabies by Nepotistic Parent Sex", size
> (medsmall)) ///
>     legend(label(1 "Male Nepobabies") label(2 "Female Nepobabies")) ///
>         ytitle("Nepobaby Count")

. 
. 
. ** Nepobaby by MOTHER
. 
. *Creating variable for male nepobabies with the same industry as their mother.
. gen malenepoma = (manepobaby == 1 & sex == 1)

. *Creating variable for female nepobabies with the same industry as their father.
. gen femalenepoma = (manepobaby == 1 & sex ==2)

. 
. *Marking irrelevant datapoints as missing
. replace malenepoma = . if manepobaby == 0
(2,704 real changes made, 2,704 to missing)

. replace femalenepoma = . if manepobaby == 0
(2,704 real changes made, 2,704 to missing)

. 
. *Removing instances of respondents having the same industry as both their mother an
> d father.
. replace malenepoma = . if (maind10 == paind10)
(24 real changes made, 24 to missing)

. replace femalenepoma = . if (maind10 == paind10)
(24 real changes made, 24 to missing)

. 
. *Testing the significance in the differences between the proportion of male and fem
> ale nepobabies with the same industry as their mother.
. ttest femalenepoma == malenepoma

Paired t test
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
femal~ma |     118    .7118644    .0418701    .4548259    .6289428     .794786
malen~ma |     118    .2881356    .0418701    .4548259     .205214    .3710572
---------+--------------------------------------------------------------------
    diff |     118    .4237288    .0837402    .9096518    .2578857     .589572
------------------------------------------------------------------------------
     mean(diff) = mean(femalenepoma - malenepoma)                 t =   5.0600
 Ho: mean(diff) = 0                              degrees of freedom =      117

 Ha: mean(diff) < 0           Ha: mean(diff) != 0           Ha: mean(diff) > 0
 Pr(T < t) = 1.0000         Pr(|T| > |t|) = 0.0000          Pr(T > t) = 0.0000

. 
. * Creating bar graph to visualize the t-test
. graph bar (mean) malenepoma (mean) femalenepoma,  title(`"Male vs. Female Nepobabie
> s - Mother"')

. 
. * Looking at the demographics of nepobabies in high unemployment
. 
. 
. 
. * RACE
. tab nepobaby race, chi2

           |        race of respondent
  nepobaby |     white      black      other |     Total
-----------+---------------------------------+----------
         0 |     1,855        430        274 |     2,559 
         1 |       222         39         26 |       287 
-----------+---------------------------------+----------
     Total |     2,077        469        300 |     2,846 

          Pearson chi2(2) =   3.1192   Pr = 0.210

. * p-value = 0.210 so this yields an insignificant result
. 
. 
. 
. * GENDER
. tab nepobaby sex, chi2

           |    respondents sex
  nepobaby |      male     female |     Total
-----------+----------------------+----------
         0 |     1,304      1,255 |     2,559 
         1 |       160        127 |       287 
-----------+----------------------+----------
     Total |     1,464      1,382 |     2,846 

          Pearson chi2(1) =   2.3720   Pr = 0.124

. * p-value = 0.124, so no strong association
. 
. 
. 
. * CLASS (self-reported)
. 
. 
. * Creating a chi-square test for nepobaby and class
. tab nepobaby class, chi2

           |       subjective class identification
  nepobaby | lower cla  working c  middle cl  upper cla |     Total
-----------+--------------------------------------------+----------
         0 |       113      1,380      1,000         60 |     2,553 
         1 |         8        155        118          6 |       287 
-----------+--------------------------------------------+----------
     Total |       121      1,535      1,118         66 |     2,840 

          Pearson chi2(3) =   1.9491   Pr = 0.583

. * This yields an insignifcant result
. 
. 
. 
. 
. * EDUCATION (college educated)
. * Creating variable for college educated nepobabies
. gen nepo_educ = (nepobaby == 1 & educ >= 16)

. 
. * Labeling irrelevant data as missing to avoid noise/confusion
. replace nepo_educ = . if nepobaby == 0
(2,559 real changes made, 2,559 to missing)

. 
. * Creating a variable for the sample of college educated people surveyed
. gen sample_educ = (educ >= 16)

. 
. * Comparing the means of college educating people in the whole sample vs. college e
> ducated nepobabies
. ttest sample_educ == nepo_educ, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sample~c |   2,846    .3169361    .0087232     .465364    .2998316    .3340405
nepo_e~c |     287    .3554007    .0283023    .4794706    .2996936    .4111078
---------+--------------------------------------------------------------------
combined |   3,133    .3204596    .0083384    .4667277    .3041103    .3368089
---------+--------------------------------------------------------------------
    diff |           -.0384646    .0289023                -.095134    .0182047
------------------------------------------------------------------------------
    diff = mean(sample_educ) - mean(nepo_educ)                    t =  -1.3309
Ho: diff = 0                                     degrees of freedom =     3131

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0917         Pr(|T| > |t|) = 0.1833          Pr(T > t) = 0.9083

. * p-value = 0.0917 that nepobabies are more likely to be college education than non
> -nepobabies - should definitely recheck this
. 
. * EDUCATION (less than high school)
. 
. gen nepo_educl = (nepobaby == 1 & educ < 12)

. 
. replace nepo_educl = . if nepobaby == 0
(2,559 real changes made, 2,559 to missing)

. 
. gen sample_educl = (educ < 12)

. 
. ttest sample_educl == nepo_educl, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sample~l |   2,846    .0997892    .0056192    .2997714    .0887711    .1108072
nepo_e~l |     287    .0940767    .0172625    .2924453     .060099    .1280543
---------+--------------------------------------------------------------------
combined |   3,133    .0992659     .005343    .2990664    .0887897    .1097421
---------+--------------------------------------------------------------------
    diff |            .0057125    .0185247               -.0306093    .0420344
------------------------------------------------------------------------------
    diff = mean(sample_educl) - mean(nepo_educl)                  t =   0.3084
Ho: diff = 0                                     degrees of freedom =     3131

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.6211         Pr(|T| > |t|) = 0.7578          Pr(T > t) = 0.3789

. * p-value = 0.3789, so no significant association
. 
. * Creating a chi-square test for nepobaby and education
. tab nepobaby educ, chi2

           |            highest year of school completed
  nepobaby | no formal          2          3          5          6 |     Total
-----------+-------------------------------------------------------+----------
         0 |         1          9          4          1          8 |     2,557 
         1 |         0          0          0          0          4 |       287 
-----------+-------------------------------------------------------+----------
     Total |         1          9          4          1         12 |     2,844 


           |            highest year of school completed
  nepobaby |         7          8          9         10         11 |     Total
-----------+-------------------------------------------------------+----------
         0 |         4         23         43         63        101 |     2,557 
         1 |         0          2          2          7         12 |       287 
-----------+-------------------------------------------------------+----------
     Total |         4         25         45         70        113 |     2,844 


           |            highest year of school completed
  nepobaby |        12         13         14         15         16 |     Total
-----------+-------------------------------------------------------+----------
         0 |       656        271        419        156        479 |     2,557 
         1 |        87         25         32         14         57 |       287 
-----------+-------------------------------------------------------+----------
     Total |       743        296        451        170        536 |     2,844 


           |      highest year of school completed
  nepobaby |        17         18         19         20 |     Total
-----------+--------------------------------------------+----------
         0 |       114        110         43         52 |     2,557 
         1 |        11         15         10          9 |       287 
-----------+--------------------------------------------+----------
     Total |       125        125         53         61 |     2,844 

         Pearson chi2(18) =  26.0158   Pr = 0.099

. 
. 
. 
. * HOURS WORKED WEEKLY (self-reported)
. * Creating variable for nepobabies who work overtime
. gen nepo_hrs = (nepobaby == 1 & hrs1 >= 45)

. 
. * Labeling irrelevant data as missing to avoid noise/confusion
. replace nepo_hrs = . if nepobaby == 0
(2,559 real changes made, 2,559 to missing)

. 
. * Creating a variable for the sample of people surveyed who work overtime
. gen sample_hrs = (hrs1 >= 45)

. 
. * Comparing the means of overtime workers in the whole sample vs. overtime working 
> nepobabies
. ttest sample_hrs == nepo_hrs, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sample~s |   2,846     .392832    .0091562    .4884658    .3748785    .4107856
nepo_hrs |     287    .4076655    .0290571    .4922587    .3504726    .4648584
---------+--------------------------------------------------------------------
combined |   3,133    .3941909    .0087319    .4887542      .37707    .4113118
---------+--------------------------------------------------------------------
    diff |           -.0148335    .0302737               -.0741917    .0445248
------------------------------------------------------------------------------
    diff = mean(sample_hrs) - mean(nepo_hrs)                      t =  -0.4900
Ho: diff = 0                                     degrees of freedom =     3131

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3121         Pr(|T| > |t|) = 0.6242          Pr(T > t) = 0.6879

. 
. 
. gen nepo_hrslow = (nepobaby == 1 & hrs1 < 30)

. 
. replace nepo_hrslow = . if nepobaby == 0
(2,559 real changes made, 2,559 to missing)

. 
. gen sample_hrslow = (hrs1 < 30)

. 
. ttest sample_hrslow == nepo_hrslow, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sample~w |   2,846    .1148981    .0059788     .318955    .1031749    .1266213
nepo_h~w |     287    .1219512    .0193495     .327801    .0838658    .1600367
---------+--------------------------------------------------------------------
combined |   3,133    .1155442    .0057122    .3197286    .1043442    .1267442
---------+--------------------------------------------------------------------
    diff |           -.0070531    .0198045               -.0458842     .031778
------------------------------------------------------------------------------
    diff = mean(sample_hrslow) - mean(nepo_hrslow)                t =  -0.3561
Ho: diff = 0                                     degrees of freedom =     3131

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.3609         Pr(|T| > |t|) = 0.7218          Pr(T > t) = 0.6391

. 
. * Creating a chi-square test for nepobaby and weekly hours worked
. 
. 
. * New t-test for hours worked
. 
. gen samplehrs = hrs1
(63 missing values generated)

. replace samplehrs = . if nepobaby == 1
(287 real changes made, 287 to missing)

. 
. gen nepohrs = hrs1
(63 missing values generated)

. replace nepohrs = . if nepobaby != 1
(2,559 real changes made, 2,559 to missing)

. 
. ttest nepohrs == samplehrs, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
 nepohrs |     278    42.13669    .8495719    14.16519    40.46425    43.80913
sam~ehrs |   2,505    42.59601    .2756253    13.79504    42.05553    43.13648
---------+--------------------------------------------------------------------
combined |   2,783    42.55013      .26217    13.83055    42.03606    43.06419
---------+--------------------------------------------------------------------
    diff |           -.4593173    .8744328                -2.17392    1.255286
------------------------------------------------------------------------------
    diff = mean(nepohrs) - mean(samplehrs)                        t =  -0.5253
Ho: diff = 0                                     degrees of freedom =     2781

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.2997         Pr(|T| > |t|) = 0.5994          Pr(T > t) = 0.7003

. * This yields an insignificant difference between the two.
. 
. 
. 
. * INCOME
. * Income variable: `realinc` is family income in base year 1986
. 
. * Creating variable for high income nepobabies (make greater than or equal to the 9
> 0th percentile of income: 66220)
. gen nepo_hinc = (nepobaby == 1 & realinc >= 66220)

. 
. * Labeling irrelevant data as missing to avoid noise/confusion
. replace nepo_hinc = . if nepobaby == 0
(2,559 real changes made, 2,559 to missing)

. 
. * Creating a variable for the proportion of males surveyed
. gen sample_hinc = (realinc >= 66220)

. 
. * Comparing the means of males in the whole sample vs. male nepobabies
. ttest sample_hinc == nepo_hinc, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sampl~nc |   2,846    .1623331    .0069135    .3688209    .1487771    .1758891
nepo_h~c |     287     .184669    .0229446    .3887066    .1395072    .2298307
---------+--------------------------------------------------------------------
combined |   3,133    .1643792    .0066224    .3706785    .1513945    .1773639
---------+--------------------------------------------------------------------
    diff |           -.0223359    .0229574                -.067349    .0226772
------------------------------------------------------------------------------
    diff = mean(sample_hinc) - mean(nepo_hinc)                    t =  -0.9729
Ho: diff = 0                                     degrees of freedom =     3131

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.1653         Pr(|T| > |t|) = 0.3307          Pr(T > t) = 0.8347

. 
. 
. * Creating variable for low income nepobabies (make less than or equal to the 25th 
> percentile of income: 14860.38)
. gen nepo_linc = (nepobaby == 1 & realinc <= 14860.38)

. 
. * Labeling irrelevant data as missing to avoid noise/confusion
. replace nepo_linc = . if nepobaby == 0
(2,559 real changes made, 2,559 to missing)

. 
. * Creating a variable for the proportion of males surveyed
. gen sample_linc = (realinc <= 14860.38)

. 
. * Comparing the means of males in the whole sample vs. male nepobabies
. ttest sample_linc == nepo_linc, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sam~linc |   2,846    .2424455    .0080348    .4286377     .226691    .2582001
nepo_l~c |     287    .2125436     .024191    .4098219    .1649285    .2601586
---------+--------------------------------------------------------------------
combined |   3,133    .2397064    .0076282    .4269724    .2247497     .254663
---------+--------------------------------------------------------------------
    diff |             .029902    .0264425               -.0219444    .0817483
------------------------------------------------------------------------------
    diff = mean(sample_linc) - mean(nepo_linc)                    t =   1.1308
Ho: diff = 0                                     degrees of freedom =     3131

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.8709         Pr(|T| > |t|) = 0.2582          Pr(T > t) = 0.1291

. 
. 
. * Creating a proper t-0test for nepobabies and income
. 
. gen sample_inc = realinc
(197 missing values generated)

. replace sample_inc = . if nepobaby == 1
(287 real changes made, 287 to missing)

. 
. gen nepoinc = realinc
(197 missing values generated)

. replace nepoinc = . if nepobaby != 1
(2,559 real changes made, 2,559 to missing)

. 
. ttest sample_inc == nepoinc, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sam~_inc |   2,382    34720.64    641.1068    31289.69    33463.46    35977.83
 nepoinc |     267    37493.26    2059.408    33651.01    33438.45    41548.07
---------+--------------------------------------------------------------------
combined |   2,649     35000.1    612.8041    31540.07    33798.48    36201.72
---------+--------------------------------------------------------------------
    diff |           -2772.619    2035.199               -6763.361    1218.123
------------------------------------------------------------------------------
    diff = mean(sample_inc) - mean(nepoinc)                       t =  -1.3623
Ho: diff = 0                                     degrees of freedom =     2647

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0866         Pr(|T| > |t|) = 0.1732          Pr(T > t) = 0.9134

. * Yield a result of no significant difference
. 
. 
. 
. * JOB SAFETY
. 
. * Creating variable for high income nepobabies (make greater than or equal to the 9
> 0th percentile of income: 66220)
. gen nepo_safe = (nepobaby == 1 & joblose == 4)

. 
. * Labeling irrelevant data as missing to avoid noise/confusion
. replace nepo_safe = . if nepobaby == 0
(2,559 real changes made, 2,559 to missing)

. replace nepo_safe = . if missing(joblose)
(122 real changes made, 122 to missing)

. 
. * Creating a variable for the proportion of males surveyed
. gen sample_safe = (joblose == 4)

. replace sample_safe = . if missing(joblose)
(1,218 real changes made, 1,218 to missing)

. 
. * Comparing the means of males in the whole sample vs. male nepobabies
. ttest sample_safe == nepo_safe, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sample~e |   1,628    .6486486    .0118354    .4775392    .6254345    .6718628
nepo_s~e |     165    .7272727    .0347769    .4467175    .6586045    .7959409
---------+--------------------------------------------------------------------
combined |   1,793     .655884    .0112227    .4752117    .6338731    .6778949
---------+--------------------------------------------------------------------
    diff |           -.0786241    .0387911               -.1547046   -.0025436
------------------------------------------------------------------------------
    diff = mean(sample_safe) - mean(nepo_safe)                    t =  -2.0269
Ho: diff = 0                                     degrees of freedom =     1791

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0214         Pr(|T| > |t|) = 0.0428          Pr(T > t) = 0.9786

. 
. * Creating bar graph for this t-test
. graph bar (mean) sample_safe (mean) nepo_safe, title(`"Job Safety for Nepobabies an
> d Sample"')

. 
. * Creating chi-square test for nepobaby and job safety
. tab nepobaby joblose, chi2

           |           is r likely to lose job
  nepobaby | very like  fairly li  not too l  not likel |     Total
-----------+--------------------------------------------+----------
         0 |        69         72        386        936 |     1,463 
         1 |        10          3         32        120 |       165 
-----------+--------------------------------------------+----------
     Total |        79         75        418      1,056 |     1,628 

          Pearson chi2(3) =   8.2233   Pr = 0.042

. * This yielded a significant result, similar to the t-test.
. 
end of do-file

. log close
      name:  <unnamed>
       log:  C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercis
> es\course-project-nepobabies\nepobabies.log
  log type:  text
 closed on:  16 Apr 2024, 12:55:12
-------------------------------------------------------------------------------------
