----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\course-project-nepobabies\nepouhoh.l
> og
  log type:  text
 opened on:  13 Mar 2024, 21:19:47


  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   16.0   Copyright 1985-2019 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

10-student Stata lab perpetual license:
       Serial number:  301606224419
         Licensed to:  Lab Install
                       Syracuse University

Notes:
      1.  Unicode is supported; see help unicode_advice.

running C:\Program Files\Stata16\profile.do ...

. doedit "C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\course-project-nepobabies\nepobabies.do
> " 

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. * Direct file path
. cd "C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\course-project-nepobabies"
C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\course-project-nepobabies

. 
. * Direct Stata to use the cleaned GSS dataset
. use "GSSclean_noRDs"

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. ** This prevents false positives from occurring for the nepobaby, panepobaby, and manepobaby variables.
. replace indus10 = 1 if missing(indus10)
(5,219 real changes made)

. 
. ** Creating dummy variable for nepobaby = 1 if respondent is in the same industry as their mother or father, 0 otherwise
. gen nepobaby = ((indus10 == paind10)|(indus10 == maind10))

. ** Create variable for being in the same industry as ONLY a respondent's father. (same false positives as nepobaby)
. gen panepobaby = (indus10 == paind10)

. ** Create variable for being in the same industry as ONLY a respondent's mother. (same false positives as nepobaby)
. gen manepobaby = (indus10 == maind10)

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. ** Getting rid of missing data
. ** dateintv variable needed to determine hire date.
. drop if missing(dateintv)
(5,111 observations deleted)

. ** We can only perform analysis for the respondents who answered the `yearsjob` question.
. drop if missing(yearsjob)
(58,023 observations deleted)

. ** Dropping observations for age not recorded - cannot accurately measure agehire without age.
. drop if missing(age)
(118 observations deleted)

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. * Convert dateintv to a string for easier manipulation
. gen dateintv_str = string(dateintv)

. 
. * Extract dayintv (last two digits)
. gen dayintv = real(substr(dateintv_str, -2, .))

. 
. * Extract monthintv based on the length of dateintv
. gen monthintv = .
(9,138 missing values generated)

. replace monthintv = real(substr(dateintv_str, 1, 1)) if length(dateintv_str) == 3
(8,394 real changes made)

. replace monthintv = real(substr(dateintv_str, 1, 2)) if length(dateintv_str) == 4
(744 real changes made)

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. rename year yearintv

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. gen ymintdate = ym(yearintv, monthintv)

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. gen ymhiredate = ymintdate - (yearsjob * 12)

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. * Merging FRED unemployment rate based on ymhiredate variable
. merge m:m ymhiredate using "C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\course-project-nepo
> babies\FRED_unrate_60to22_robust.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                           273
        from master                        12  (_merge==1)
        from using                        261  (_merge==2)

    matched                             9,126  (_merge==3)
    -----------------------------------------

. 
end of do-file

. browse yearintv indus10 paind10 maind10

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

.  drop if _merge == 1
(12 observations deleted)

.  drop if _merge == 2
(261 observations deleted)

. 
. rename UNRATE unemployrate

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. drop if agehire > 29
agehire not found
r(111);

end of do-file

r(111);

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. gen agehire = age - yearsjob

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. drop if agehire > 29
(5,576 observations deleted)

. 
end of do-file

. drop if yearintv >= 2022
(698 observations deleted)

. sum unemployrate, detail

                           UNRATE
-------------------------------------------------------------
      Percentiles      Smallest
 1%          3.8            3.4
 5%            4            3.4
10%          4.3            3.4       Obs               2,852
25%          4.7            3.4       Sum of Wgt.       2,852

50%          5.5                      Mean               5.85
                        Largest       Std. Dev.      1.574756
75%          6.8           10.2
90%          8.2           10.2       Variance       2.479856
95%          9.5           10.3       Skewness       1.011425
99%          9.9           10.3       Kurtosis       3.228155

. gen unemployrate_groups = .
(2,852 missing values generated)

. 
. 
. 
. replace unemployrate_groups = 1 if unemployrate <= 4.7
(807 real changes made)

. 
. 
. 
. replace unemployrate_groups = 2 if (unemployrate > 4.7) & (unemployrate <= 5.5)
(673 real changes made)

. 
. 
. 
. replace unemployrate_groups = 3 if (unemployrate > 5.5) & (unemployrate < 6.8)
(652 real changes made)

. 
. 
. 
. replace unemployrate_groups = 4 if unemployrate >= 6.8
(720 real changes made)

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. tabulate nepobaby unemployrate_groups, chi2

           |             unemployrate_groups
  nepobaby |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       736        605        585        639 |     2,565 
         1 |        71         68         67         81 |       287 
-----------+--------------------------------------------+----------
     Total |       807        673        652        720 |     2,852 

          Pearson chi2(3) =   2.5817   Pr = 0.461

. 
end of do-file

. logit nepobaby unemployrate

Iteration 0:   log likelihood = -931.08534  
Iteration 1:   log likelihood = -930.74726  
Iteration 2:   log likelihood = -930.74697  
Iteration 3:   log likelihood = -930.74697  

Logistic regression                             Number of obs     =      2,852
                                                LR chi2(1)        =       0.68
                                                Prob > chi2       =     0.4107
Log likelihood = -930.74697                     Pseudo R2         =     0.0004

------------------------------------------------------------------------------
    nepobaby |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
unemployrate |   .0320926   .0387615     0.83   0.408    -.0438786    .1080637
       _cons |  -2.379002   .2375541   -10.01   0.000      -2.8446   -1.913405
------------------------------------------------------------------------------

. count if indus10 = 1
=exp not allowed
r(101);

. count if indus10 == 1
  9

. count if paind10 == iap
iap not found
r(111);

. browse paind10 maind10 indus10

. gen nepowh = .
(2,852 missing values generated)

. replace nepowh = 1 if (nepobaby == 1 & race == 1)
(222 real changes made)

. replace nepowh = 0 if (nepobaby == 0 & race == 1)
(1,861 real changes made)

. tabulate nepowh unemployrate_groups, chi2

           |             unemployrate_groups
    nepowh |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       536        429        430        466 |     1,861 
         1 |        54         53         51         64 |       222 
-----------+--------------------------------------------+----------
     Total |       590        482        481        530 |     2,083 

          Pearson chi2(3) =   2.5820   Pr = 0.461

. gen nepomale = .
(2,852 missing values generated)

. replace nepomale = 1 if (sex == 1 & nepobaby == 1)
(160 real changes made)

. replace nepomale = 0 if (sex == 1 & nepobaby == 0)
(1,308 real changes made)

. tabulate nepomale unemployrate_groups, chi2

           |             unemployrate_groups
  nepomale |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       351        317        313        327 |     1,308 
         1 |        41         39         40         40 |       160 
-----------+--------------------------------------------+----------
     Total |       392        356        353        367 |     1,468 

          Pearson chi2(3) =   0.1472   Pr = 0.986

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. gen neposex = 1 if sex == 1
(1,384 missing values generated)

. replace neposex = 2 if sex == 2
(1,384 real changes made)

. replace neposex = . if nepobaby == 0
(2,565 real changes made, 2,565 to missing)

. gen nepoparentsex = 1 if (indus10 == paind10)
(2,683 missing values generated)

. replace nepoparentsex = 2 if (indus10 == maind10)
(142 real changes made)

. replace nepoparentsex = . if (indus10 != paind10 & indus10 != maind10)
(0 real changes made)

. replace nepoparentsex = . if (paind10 == maind10)
(24 real changes made, 24 to missing)

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. tab neposex nepoparentsex, chi2

           |     nepoparentsex
   neposex |         1          2 |     Total
-----------+----------------------+----------
         1 |       116         34 |       150 
         2 |        29         84 |       113 
-----------+----------------------+----------
     Total |       145        118 |       263 

          Pearson chi2(1) =  69.5578   Pr = 0.000

. 
end of do-file

. gen nepofemale = .
(2,852 missing values generated)

. replace nepofemale = 1 if (sex == 2 & nepobaby == 1)
(127 real changes made)

. replace nepomale = 0 if (sex == 2 & nepobaby == 0)
(1,257 real changes made)

. tabulate nepofemale unemployrate_groups, chi2

           |             unemployrate_groups
nepofemale |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         1 |        30         29         27         41 |       127 
-----------+--------------------------------------------+----------
     Total |        30         29         27         41 |       127 

. replace nepofemale = 0 if (sex == 2 & nepobaby == 0)
(1,257 real changes made)

. tabulate nepofemale unemployrate_groups, chi2

           |             unemployrate_groups
nepofemale |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       385        288        272        312 |     1,257 
         1 |        30         29         27         41 |       127 
-----------+--------------------------------------------+----------
     Total |       415        317        299        353 |     1,384 

          Pearson chi2(3) =   4.4148   Pr = 0.220

. tab class

             subjective class |
               identification |      Freq.     Percent        Cum.
------------------------------+-----------------------------------
                  lower class |        121        4.25        4.25
                working class |      1,537       54.02       58.28
                 middle class |      1,121       39.40       97.68
                  upper class |         66        2.32      100.00
------------------------------+-----------------------------------
                        Total |      2,845      100.00

. gen nepomidup = .
(2,852 missing values generated)

. 
. 
. 
. replace nepomidup = 1 if (class >= 3 & nepobaby == 1)
(124 real changes made)

. 
. 
. 
. replace nepomidup = 0 if (class >= 3 & nepobaby == 0)
(1,070 real changes made)

. 
. 
. 
. tabulate nepofemale unemployrate_groups, chi2

           |             unemployrate_groups
nepofemale |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       385        288        272        312 |     1,257 
         1 |        30         29         27         41 |       127 
-----------+--------------------------------------------+----------
     Total |       415        317        299        353 |     1,384 

          Pearson chi2(3) =   4.4148   Pr = 0.220

. tabulate nepomidup unemployrate_groups, chi2

           |             unemployrate_groups
 nepomidup |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       287        258        250        275 |     1,070 
         1 |        33         27         25         39 |       124 
-----------+--------------------------------------------+----------
     Total |       320        285        275        314 |     1,194 

          Pearson chi2(3) =   2.1487   Pr = 0.542

. gen nepowl = .
(2,852 missing values generated)

. 
. 
. 
. replace nepowl = 1 if (class < 3 & nepobaby == 1)
(163 real changes made)

. 
. 
. 
. replace nepowl = 0 if (class < 3 & nepobaby == 0)
(1,495 real changes made)

. 
. 
. 
. tabulate nepowl unemployrate_groups, chi2

           |             unemployrate_groups
    nepowl |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       449        347        335        364 |     1,495 
         1 |        38         41         42         42 |       163 
-----------+--------------------------------------------+----------
     Total |       487        388        377        406 |     1,658 

          Pearson chi2(3) =   3.3471   Pr = 0.341

. tab class nepobaby

     subjective class |       nepobaby
       identification |         0          1 |     Total
----------------------+----------------------+----------
          lower class |       113          8 |       121 
        working class |     1,382        155 |     1,537 
         middle class |     1,003        118 |     1,121 
          upper class |        60          6 |        66 
----------------------+----------------------+----------
                Total |     2,558        287 |     2,845 

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. tab nepobaby class, chi2

           |       subjective class identification
  nepobaby | lower cla  working c  middle cl  upper cla |     Total
-----------+--------------------------------------------+----------
         0 |       113      1,382      1,003         60 |     2,558 
         1 |         8        155        118          6 |       287 
-----------+--------------------------------------------+----------
     Total |       121      1,537      1,121         66 |     2,845 

          Pearson chi2(3) =   1.9221   Pr = 0.589

. 
end of do-file

. tab educ

       highest year of school |
                    completed |      Freq.     Percent        Cum.
------------------------------+-----------------------------------
          no formal schooling |          1        0.04        0.04
                            2 |          9        0.32        0.35
                            3 |          4        0.14        0.49
                            5 |          1        0.04        0.53
                            6 |         12        0.42        0.95
                            7 |          4        0.14        1.09
                            8 |         25        0.88        1.96
                            9 |         45        1.58        3.54
                           10 |         70        2.46        6.00
                           11 |        113        3.96        9.96
                           12 |        747       26.21       36.18
                           13 |        297       10.42       46.60
                           14 |        451       15.82       62.42
                           15 |        170        5.96       68.39
                           16 |        537       18.84       87.23
                           17 |        125        4.39       91.61
                           18 |        125        4.39       96.00
                           19 |         53        1.86       97.86
                           20 |         61        2.14      100.00
------------------------------+-----------------------------------
                        Total |      2,850      100.00

. gen nepohe = .
(2,852 missing values generated)

. 
. 
. 
. replace nepohe = 1 if (educ <= 13 & nepobaby == 1)
(139 real changes made)

. 
. 
. 
. replace nepohe = 0 if (educ <= 13 & nepobaby == 0)
(1,189 real changes made)

. 
. 
. 
. tabulate nepohe unemployrate_groups, chi2

           |             unemployrate_groups
    nepohe |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       356        278        262        293 |     1,189 
         1 |        31         34         35         39 |       139 
-----------+--------------------------------------------+----------
     Total |       387        312        297        332 |     1,328 

          Pearson chi2(3) =   3.6846   Pr = 0.298

. gen nepole = .
(2,852 missing values generated)

. 
. 
. 
. replace nepole = 1 if (educ >= 13 & nepobaby == 1)
(173 real changes made)

. 
. 
. 
. replace nepole = 0 if (educ >= 13 & nepobaby == 0)
(1,648 real changes made)

. 
. 
. 
. tabulate nepole unemployrate_groups, chi2

           |             unemployrate_groups
    nepole |         1          2          3          4 |     Total
-----------+--------------------------------------------+----------
         0 |       459        386        388        415 |     1,648 
         1 |        43         42         39         49 |       173 
-----------+--------------------------------------------+----------
     Total |       502        428        427        464 |     1,821 

          Pearson chi2(3) =   1.2319   Pr = 0.745

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. gen sample_inc = realinc
(201 missing values generated)

. replace sample_inc = . if nepobaby == 1
(287 real changes made, 287 to missing)

. 
. gen nepoinc = realinc
(201 missing values generated)

. replace nepoinc = . if nepobaby != 1
(2,565 real changes made, 2,565 to missing)

. 
end of do-file

. do "C:\Users\LOCAL_~4\Temp\STD3b68_000000.tmp"

. ttest sample_inc == nepoinc, unpaired

Two-sample t test with equal variances
------------------------------------------------------------------------------
Variable |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
sample~c |   2,384     34759.4    641.5653    31325.21    33501.32    36017.48
 nepoinc |     267    37493.26    2059.408    33651.01    33438.45    41548.07
---------+--------------------------------------------------------------------
combined |   2,651    35034.74    613.1788    31571.27    33832.39     36237.1
---------+--------------------------------------------------------------------
    diff |           -2733.861    2037.148               -6728.422      1260.7
------------------------------------------------------------------------------
    diff = mean(sample_inc) - mean(nepoinc)                       t =  -1.3420
Ho: diff = 0                                     degrees of freedom =     2649

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0899         Pr(|T| > |t|) = 0.1797          Pr(T > t) = 0.9101

. 
end of do-file

. logit nepobaby realinc

Iteration 0:   log likelihood = -865.96214  
Iteration 1:   log likelihood = -865.10451  
Iteration 2:   log likelihood =  -865.0995  
Iteration 3:   log likelihood =  -865.0995  

Logistic regression                             Number of obs     =      2,651
                                                LR chi2(1)        =       1.73
                                                Prob > chi2       =     0.1890
Log likelihood =  -865.0995                     Pseudo R2         =     0.0010

------------------------------------------------------------------------------
    nepobaby |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     realinc |   2.58e-06   1.92e-06     1.34   0.180    -1.19e-06    6.34e-06
       _cons |  -2.282222    .096285   -23.70   0.000    -2.470938   -2.093507
------------------------------------------------------------------------------

. log using nepouhoh.log
----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\course-project-nepobabies\nepouhoh.l
> og
  log type:  text
 opened on:  13 Mar 2024, 21:19:47

. 


. log close
      name:  <unnamed>
       log:  C:\Users\rpseely\OneDrive - Syracuse University\Documents\GitHub\exercises\course-project-nepobabies\nepouhoh.l
> og
  log type:  text
 closed on:  13 Mar 2024, 21:21:54
----------------------------------------------------------------------------------------------------------------------------
